artillery/artillery.yaml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 5
      arrivalCount: 1000
  environments:
    testing:
      target: "http://localhost:8000"
  processor: "./processor.js"

scenarios:
  - name: "Increment Helpful"
    flow:
      - put:
          beforeRequest: randomReviewId
          url: "/reviews/helpful"
          qs:
            review_id: "{{ reviewId }}"
  - name: "Get Reviews"
    flow:
      - get:
          beforeRequest: randomProductId
          url: "/reviews"
          qs:
            product_id: "{{ productId }}"